src/DataProcessors/СозданиеНакладныхНаСборку/СозданиеНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеНакладныхНаСборку</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/РезервированиеГП/РезервированиеГП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервированиеГП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/СтатусыНакладныхНаСборку/СтатусыНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНакладныхНаСборку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНакладнойНаСборку</types>
    </type>
  </resources>
  <dimensions>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЯчейкиХранения/ЯчейкиХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯчейкиХранения</name>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллажи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стойка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Полка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыДоставки/ТипыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОтгрузки/ВидыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтгрузки</name>
  <enumValues>
    <name>Частичная</name>
  </enumValues>
  <enumValues>
    <name>Полная</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ЗоныКомплектации/ЗоныКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗоныКомплектации</name>
  <enumValues>
    <name>УПЭА</name>
  </enumValues>
  <enumValues>
    <name>УД</name>
  </enumValues>
  <enumValues>
    <name>ДД</name>
  </enumValues>
  <enumValues>
    <name>ТНП</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыНакладнойНаСборку/СтатусыНакладнойНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНакладнойНаСборку</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>НаСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НаУпаковке</name>
  </enumValues>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/СозданиеНакладныхНаСборку/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьКоличествоНаИспытаниях(ЗНП,Продукция)
Запрос = Новый Запрос;

Количество = 0;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование = &ДокументОснование
	|	И ПроизводственноеЗадание.Изделие = &Изделие
	|	И (ПроизводственноеЗадание.Испытания <> 0
	|			ИЛИ ПроизводственноеЗадание.СторонняяПоверка = ИСТИНА)";
Запрос.УстановитьПараметр("ДокументОснование", ЗНП);
Запрос.УстановитьПараметр("Изделие", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПЗ = РезультатЗапроса.Выбрать();
	Пока ВыборкаПЗ.Следующий() Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукцииПоступление.Количество КАК Количество
		|ИЗ
		|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
		|ГДЕ
		|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование = &ДокументОснование
		|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА";
	Запрос.УстановитьПараметр("ДокументОснование", ВыборкаПЗ.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество = Количество + ВыборкаДетальныеЗаписи.Количество;
		КонецЦикла;
	КонецЦикла;
Возврат(Количество); 
КонецФункции

&НаСервере
Функция ПолучитьКоличествоВПроизводствеБезДатыГП(ЗНП,Продукция)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Номенклатура КАК Номенклатура,
	|	СУММА(ВыпускПродукцииПоступление.Количество) КАК Количество
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование = &ДокументОснование
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Испытания = 0
	|	И ВыпускПродукцииПоступление.Номенклатура = &Номенклатура
	|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДатаГрупповойУпаковки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыпускПродукцииПоступление.Номенклатура";
Запрос.УстановитьПараметр("ДокументОснование", ЗНП);
Запрос.УстановитьПараметр("Номенклатура", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
Возврат(0); 
КонецФункции

&НаСервере
Функция ПроверитьЧастичнуюОтгрузку(ЗНП)
Запрос = Новый Запрос;
ТЗ = Новый ТаблицаЗначений;

ТЗ.Колонки.Добавить("Товар");
ТЗ.Колонки.Добавить("Продукция");
ТЗ.Колонки.Добавить("Количество");

	Для каждого ТЧ Из ЗНП.Заказ Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("Неопределено") Тогда
		Продолжить;
		КонецЕсли;
			Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если ТЧ.Продукция.ЗапрещеноКОтгрузке Тогда
				Продолжить;
				КонецЕсли; 
			МестоХранения = ТЧ.Продукция.Линейка.МестоХраненияГП;
			Иначе
			МестоХранения = Константы.МестоХраненияТНП.Получить();
			КонецЕсли;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеГПОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.РезервированиеГП.Остатки(
		|			,
		|			МестоХранения = &МестоХранения
		|				И Продукция = &Продукция
		|				И Документ = &Документ) КАК РезервированиеГПОстатки
		|ГДЕ
		|	РезервированиеГПОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("Документ", ЗНП);
	Запрос.УстановитьПараметр("Продукция", ТЧ.Продукция);
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоРезерв = ВыборкаДетальныеЗаписи.КоличествоОстаток - ПолучитьКоличествоНаИспытаниях(ЗНП,ТЧ.Продукция);
			Если КоличествоРезерв > 0 Тогда
				Если ТЧ.Товар.ТоварнаяГруппа.ГрупповаяУпаковка Тогда              
				КоличествоРезерв = КоличествоРезерв - ПолучитьКоличествоВПроизводствеБезДатыГП(ЗНП,ТЧ.Продукция);
					Если КоличествоРезерв > 0 Тогда
					ТЧ_ТЗ = ТЗ.Добавить();
					ТЧ_ТЗ.Товар = ТЧ.Товар;
					ТЧ_ТЗ.Продукция = ТЧ.Продукция;
					ТЧ_ТЗ.Количество = КоличествоРезерв;
					КонецЕсли; 
			    Иначе
				ТЧ_ТЗ = ТЗ.Добавить();
				ТЧ_ТЗ.Товар = ТЧ.Товар;
				ТЧ_ТЗ.Продукция = ТЧ.Продукция;
				ТЧ_ТЗ.Количество = КоличествоРезерв;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
Возврат(ТЗ); 
КонецФункции

&НаСервере
Функция ЕстьНаИспытаниях(ЗНП)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроизводственноеЗадание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование = &ДокументОснование
	|	И (ПроизводственноеЗадание.Испытания <> 0
	|			ИЛИ ПроизводственноеЗадание.СторонняяПоверка = ИСТИНА)";
Запрос.УстановитьПараметр("ДокументОснование", ЗНП);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой()); 
КонецФункции

&НаСервере
Функция ПроверитьПолнуюОтгрузку(ЗНП)
ТЗ = Новый ТаблицаЗначений;
Результат = Новый Структура("Полный,ТЗ",Ложь,ТЗ);

ТЗ.Колонки.Добавить("Товар");
ТЗ.Колонки.Добавить("Продукция");
ТЗ.Колонки.Добавить("Количество");
	Если ЕстьНаИспытаниях(ЗНП) Тогда
	Результат.Полный = Ложь;	
	Возврат(Результат);				
	КонецЕсли;

Запрос = Новый Запрос; 

	Для каждого ТЧ Из ЗНП.Заказ Цикл
		Если ТипЗнч(ТЧ.Продукция) = Тип("Неопределено") Тогда
		Результат.Полный = Ложь;	
		Возврат(Результат);
		КонецЕсли;
			Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если ТЧ.Продукция.ЗапрещеноКОтгрузке Тогда
				Результат.Полный = Ложь;	
				Возврат(Результат);
				КонецЕсли;
			КонецЕсли;
	КолОстатокДолги = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоДолгам(ЗНП,ТЧ.Продукция,ТекущаяДата());
		Если КолОстатокДолги = 0 Тогда	
		Продолжить;
		КонецЕсли; 
			Если ТипЗнч(ТЧ.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
			МестоХранения = ТЧ.Продукция.Линейка.МестоХраненияГП; 
			Иначе
			МестоХранения = Константы.МестоХраненияТНП.Получить();
			КонецЕсли;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеГПОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.РезервированиеГП.Остатки(
		|			,
		|			МестоХранения = &МестоХранения
		|				И Продукция = &Продукция
		|				И Документ = &Документ) КАК РезервированиеГПОстатки";
	Запрос.УстановитьПараметр("Документ", ЗНП); 
	Запрос.УстановитьПараметр("МестоХранения",МестоХранения);
	Запрос.УстановитьПараметр("Продукция", ТЧ.Продукция);
	РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.КоличествоОстаток = КолОстатокДолги Тогда
				ТЧ_ТЗ = ТЗ.Добавить();
				ТЧ_ТЗ.Товар = ТЧ.Товар;
				ТЧ_ТЗ.Продукция = ТЧ.Продукция;	
				ТЧ_ТЗ.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;					
				Иначе	
				Результат.Полный = Ложь;
				Возврат(Результат);					
				КонецЕсли; 
			КонецЦикла;
		Иначе
		Результат.Полный = Ложь;	
		Возврат(Результат);
		КонецЕсли;
	КонецЦикла;
Результат.Полный = Истина;
Возврат(Результат); 
КонецФункции 

&НаСервере
Процедура ПолучитьЗНПНаСервере()
ТаблицаЗНП.Очистить();
Запрос = Новый Запрос;

ДН = ДеньНедели(ТекущаяДата());
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
	|	ЗаказНаПроизводство.Контрагент КАК Контрагент,
	|	ЗаказНаПроизводство.КартаДоставки КАК КартаДоставки
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Закрыт = ЛОЖЬ
	|	И ЗаказНаПроизводство.ОтгрузкаРазрешена = ИСТИНА
	|	И ЗаказНаПроизводство.ВидОтгрузки <> &ВидОтгрузки
	|	И ЗаказНаПроизводство.ВЭД = &ВЭД";
	Если Не Контрагент.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент); 
	КонецЕсли;
		Если ТипДоставки = 1 Тогда
		Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.ТипДоставки = &ТипДоставки";
		Запрос.УстановитьПараметр("ТипДоставки",Перечисления.ТипыДоставки.ТранспортнаяКомпания);
		ИначеЕсли ТипДоставки = 2 Тогда
		Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.ТипДоставки = &ТипДоставки";
		Запрос.УстановитьПараметр("ТипДоставки",Перечисления.ТипыДоставки.Самовывоз);
		КонецЕсли;  
			Если ОтгрузкаПоЗапросу Тогда
			Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.ОтгрузкаПоЗапросу = ИСТИНА";
			Иначе
			Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.ОтгрузкаПоЗапросу = ЛОЖЬ";	
				Если СписокДнейНедели = 0 Тогда
					Если ДН = 1 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Понедельник = ИСТИНА";
					ИначеЕсли ДН = 2 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Вторник = ИСТИНА";
					ИначеЕсли ДН = 3 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Среда = ИСТИНА";
					ИначеЕсли ДН = 4 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Четверг = ИСТИНА";
					ИначеЕсли ДН = 5 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Пятница = ИСТИНА";
					ИначеЕсли ДН = 6 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Суббота = ИСТИНА";
					ИначеЕсли ДН = 7 Тогда
					Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Воскресенье = ИСТИНА";	
					КонецЕсли;
				ИначеЕсли СписокДнейНедели = 1 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Понедельник = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 2 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Вторник = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 3 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Среда = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 4 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Четверг = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 5 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Пятница = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 6 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Суббота = ИСТИНА";
				ИначеЕсли СписокДнейНедели = 7 Тогда
				Запрос.Текст = Запрос.Текст + " И ЗаказНаПроизводство.Воскресенье = ИСТИНА";	
				КонецЕсли;	
			КонецЕсли;
Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО
								|	ЗаказНаПроизводство.Контрагент.Наименование,
								|	КартаДоставки
								|ИТОГИ ПО
								|	Контрагент,
								|	КартаДоставки";
//Запрос.УстановитьПараметр("Дата",Дата(2019,9,1,0,0,0));
Запрос.УстановитьПараметр("ВидОтгрузки",Перечисления.ВидыОтгрузки.ПустаяСсылка()); 
Запрос.УстановитьПараметр("ВЭД",ВЭД);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаКонтрагенты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонтрагенты.Следующий() Цикл
	ВыборкаКД = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКД.Следующий() Цикл
		КоличествоВсего = 0;
		флДобавлен = Ложь;
		ВыборкаДетальныеЗаписи = ВыборкаКД.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Частичная Тогда
				ТЗ = ПроверитьЧастичнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);
				Количество = 0;
					Для каждого ТЧ_Тов Из ТЗ Цикл
					Количество = Количество + ТЧ_Тов.Количество;				
					КонецЦикла; 	
						Если Количество > 0 Тогда
							Если Не флДобавлен Тогда
							ТЧ = ТаблицаЗНП.Добавить();
							ТЧ.Контрагент = ВыборкаКонтрагенты.Контрагент;
							ТЧ.КартаДоставки = ВыборкаКД.КартаДоставки;
		                    флДобавлен = Истина;
							КонецЕсли; 
						ТЧ_ТЗ = ТЧ.ТаблицаЗаказов.Добавить();
						ТЧ_ТЗ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;
						ТЧ_ТЗ.ДатаОбработкиЛогистом = ВыборкаДетальныеЗаписи.Ссылка.ДатаОбработкиЛогистом;
						ТЧ_ТЗ.ОтгрузкаРазрешена = ВыборкаДетальныеЗаписи.Ссылка.ОтгрузкаРазрешена;
						ТЧ_ТЗ.Количество = Количество;
							Для каждого ТЧ_Тов Из ТЗ Цикл
							ТЧ_ТЗ_Т = ТЧ_ТЗ.ТаблицаТоваров.Добавить();
							ТЧ_ТЗ_Т.Товар = ТЧ_Тов.Товар;
							ТЧ_ТЗ_Т.Продукция = ТЧ_Тов.Продукция;
							ТЧ_ТЗ_Т.Количество = ТЧ_Тов.Количество;				
							КонецЦикла;					
						КонецЕсли;
				КоличествоВсего = КоличествоВсего + Количество;
				ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Полная Тогда
				Результат = ПроверитьПолнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);
				Количество = 0;
		 			Если Результат.Полный Тогда
						Если Не флДобавлен Тогда
						ТЧ = ТаблицаЗНП.Добавить();
						ТЧ.Контрагент = ВыборкаКонтрагенты.Контрагент;
						ТЧ.КартаДоставки = ВыборкаКД.КартаДоставки;
	                    флДобавлен = Истина;
						КонецЕсли;
							Для каждого ТЧ_Тов Из Результат.ТЗ Цикл
							Количество = Количество + ТЧ_Тов.Количество;				
							КонецЦикла;
					ТЧ_ТЗ = ТЧ.ТаблицаЗаказов.Добавить();
					ТЧ_ТЗ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;
					ТЧ_ТЗ.ОтгрузкаРазрешена = ВыборкаДетальныеЗаписи.Ссылка.ОтгрузкаРазрешена;
					ТЧ_ТЗ.Количество = Количество;
						Для каждого ТЧ_Тов Из Результат.ТЗ Цикл
						ТЧ_ТЗ_Т = ТЧ_ТЗ.ТаблицаТоваров.Добавить();
						ТЧ_ТЗ_Т.Товар = ТЧ_Тов.Товар;
						ТЧ_ТЗ_Т.Продукция = ТЧ_Тов.Продукция;
						ТЧ_ТЗ_Т.Количество = ТЧ_Тов.Количество;				
						КонецЦикла;						
					КонецЕсли;
				КоличествоВсего = КоличествоВсего + Количество;
				КонецЕсли; 
			КонецЦикла;
				Если флДобавлен Тогда
				ТЧ.Количество = КоличествоВсего;
				КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗНП(Команда)
Состояние("Обработка...",,"Получение данных...");
ПолучитьЗНПНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоННС(ЗНП,Продукция,КоличествоВЗаказе)
Запрос = Новый Запрос;

	Если ТипЗнч(Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
	МестоХранения = Продукция.Линейка.МестоХраненияГП;
	Иначе	
	МестоХранения = Константы.МестоХраненияТНП.Получить();
	КонецЕсли;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервированиеГПОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.РезервированиеГП.Остатки КАК РезервированиеГПОстатки
	|ГДЕ
	|	РезервированиеГПОстатки.МестоХранения = &МестоХранения
	|	И РезервированиеГПОстатки.Продукция = &Продукция
	|	И РезервированиеГПОстатки.Документ = &Документ";
Запрос.УстановитьПараметр("Документ", ЗНП); 
Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
Запрос.УстановитьПараметр("Продукция", Продукция);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 Тогда
			Если Продукция.Товар.ТоварнаяГруппа.ГрупповаяУпаковка Тогда
				Если КоличествоВЗаказе = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
				Возврат(ВыборкаДетальныеЗаписи.КоличествоОстаток);
				КонецЕсли; 
		    Иначе
			Возврат(ВыборкаДетальныеЗаписи.КоличествоОстаток);
			КонецЕсли;		
		КонецЕсли;	 
	КонецЦикла;
Возврат(0);
КонецФункции 

&НаСервере
Процедура СоздатьННСНаСервере(ДатаОтгрузки)
ННС = Неопределено;
	Для каждого ТЧ Из ТаблицаЗНП Цикл
		Если ТЧ.Пометка Тогда
			Если ТЧ.КартаДоставки.Пустая() Тогда
			Продолжить;
			КонецЕсли;
				Если ТЧ.СписокНС.Количество() > 0 Тогда
				Продолжить;
				КонецЕсли;
					Попытка
					НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
					ННС = Документы.НакладнаяНаСборку.СоздатьДокумент();
					ННС.Автор = ПараметрыСеанса.Пользователь;
					ННС.Дата = ТекущаяДата();
					ННС.Контрагент = ТЧ.Контрагент;
					ННС.КартаДоставки = ТЧ.КартаДоставки;
					ННС.Комментарий = ТЧ.Комментарий;
						Если ДатаОтгрузки = Неопределено Тогда
						ННС.ДатаОтгрузки = ПолучитьДатуОтгрузки();
						Иначе	
						ННС.ДатаОтгрузки = ДатаОтгрузки;
						КонецЕсли;
							Если ТЧ.Контрагент.Код = "99999911267" Тогда
							КоличествоЗаказов = 10;
							Иначе
							КоличествоЗаказов = 1000;	
							КонецЕсли;
								Для каждого ТЧ_ЗНП Из ТЧ.ТаблицаЗаказов Цикл
									Если Не ТЧ_ЗНП.Создана Тогда
										Если ТЧ_ЗНП.ОтгрузкаРазрешена Тогда
											Для каждого ТЧ_З Из ТЧ_ЗНП.ТаблицаТоваров Цикл
											ТЧ_ННС = ННС.ТабличнаяЧасть.Добавить();
											ТЧ_ННС.ЗаказНаПроизводство = ТЧ_ЗНП.ЗаказНаПроизводство;
											ТЧ_ННС.Товар = ТЧ_З.Товар;
											ТЧ_ННС.Продукция = ТЧ_З.Продукция;
											ТЧ_ННС.Количество = ТЧ_З.Количество;
												Если ТипЗнч(ТЧ_З.Продукция) = Тип("СправочникСсылка.Номенклатура") Тогда
												ЗонаКомплектации = ТЧ_З.Продукция.Линейка.ЗонаКомплектации;	
												Иначе
												ЗонаКомплектации = Перечисления.ЗоныКомплектации.ТНП;
												КонецЕсли;
													Если ННС.ЗоныКомплектации.Найти(ЗонаКомплектации,"ЗонаКомплектации") = Неопределено Тогда
													ТЧ_ЗК = ННС.ЗоныКомплектации.Добавить();
													ТЧ_ЗК.ЗонаКомплектации = ЗонаКомплектации;
													КонецЕсли;								 
											КонецЦикла; 
												Если КоличествоЗаказов = 1 Тогда
												ННС.ТабличнаяЧасть.Сортировать("Товар");
												ННС.ЛинейкаУпаковки = ННС.ТабличнаяЧасть[0].ЗаказНаПроизводство.ЛинейкаУпаковки;
												ННС.Записать(РежимЗаписиДокумента.Проведение);
												СННС = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьМенеджерЗаписи();
												СННС.Период = ТекущаяДата();
												СННС.НакладнаяНаСборку = ННС.Ссылка;
												СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.Создан;
												СННС.Записать();
												ТЧ.СписокНС.Добавить(ННС.Ссылка);
												ННС = Документы.НакладнаяНаСборку.СоздатьДокумент();
												ННС.Автор = ПараметрыСеанса.Пользователь;
												ННС.Дата = ТекущаяДата();
												ННС.Контрагент = ТЧ.Контрагент;
												ННС.КартаДоставки = ТЧ.КартаДоставки;
												ННС.Комментарий = ТЧ.Комментарий;
													Если ДатаОтгрузки = Неопределено Тогда
													ННС.ДатаОтгрузки = ПолучитьДатуОтгрузки();
													Иначе	
													ННС.ДатаОтгрузки = ДатаОтгрузки;
													КонецЕсли;
											    КоличествоЗаказов = 10;
												Иначе     				
											    КоличествоЗаказов = КоличествоЗаказов - 1;
												КонецЕсли; 
										ТЧ_ЗНП.Создана = Истина;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
									Если ННС.ТабличнаяЧасть.Количество() > 0 Тогда
									ННС.ТабличнаяЧасть.Сортировать("Товар");
									ННС.ЛинейкаУпаковки = ННС.ТабличнаяЧасть[0].ЗаказНаПроизводство.ЛинейкаУпаковки;
									ННС.Записать(РежимЗаписиДокумента.Проведение);
									СННС = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьМенеджерЗаписи();
									СННС.Период = ТекущаяДата();
									СННС.НакладнаяНаСборку = ННС.Ссылка;
									СННС.Статус = Перечисления.СтатусыНакладнойНаСборку.Создан;
									СННС.Записать();
									ТЧ.СписокНС.Добавить(ННС.Ссылка);
									ТЧ_ЗНП.Создана = Истина;
									КонецЕсли;
					ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
					Исключение
					Сообщить(ОписаниеОшибки());
					ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
					КонецПопытки;  
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьННС(Команда)
	Если ОтгрузкаПоЗапросу Тогда
	ДатаОтгрузки = ТекущаяДата();
		Если ВвестиДату(ДатаОтгрузки,"Введите дату отгрузки",ЧастиДаты.Дата) Тогда
		СоздатьННСНаСервере(ДатаОтгрузки);
		КонецЕсли;
	Иначе
	СоздатьННСНаСервере(Неопределено);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуОтгрузки()
ТекущийДеньНедели = ДеньНедели(ТекущаяДата());
	Если СписокДнейНедели = 0 Тогда
	ДатаОтгрузки = ТекущаяДата();
	ИначеЕсли СписокДнейНедели = ТекущийДеньНедели Тогда	
	ДатаОтгрузки = ТекущаяДата();
	ИначеЕсли СписокДнейНедели > ТекущийДеньНедели Тогда
	ДатаОтгрузки = ТекущаяДата()+86400*(СписокДнейНедели-ТекущийДеньНедели);
	Иначе
	ДатаОтгрузки = ТекущаяДата()+86400*(7+СписокДнейНедели-ТекущийДеньНедели);
	КонецЕсли; 
Возврат(ДатаОтгрузки);
КонецФункции 

&НаСервере
Функция ПечатьННСНаСервере()
ТабДок = Новый ТабличныйДокумент;
ТаблицаННС = Новый ТаблицаЗначений;

ТаблицаННС.Колонки.Добавить("Товар");
ТаблицаННС.Колонки.Добавить("Продукция");
ТаблицаННС.Колонки.Добавить("ГруппаЛинеек");
ТаблицаННС.Колонки.Добавить("Порядок");
ТаблицаННС.Колонки.Добавить("Количество");

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");
	Для каждого ТЧ Из ТаблицаЗНП Цикл
		Если Не ТЧ.Пометка Тогда
		Продолжить;
		КонецЕсли;
			Если ТЧ.СписокНС.Количество() = 0 Тогда
			Продолжить;
			КонецЕсли;
				Для каждого НС Из ТЧ.СписокНС Цикл
				ТаблицаННС.Очистить();
					Для каждого ТЧ_ТЧ Из НС.Значение.ТабличнаяЧасть Цикл	
					ТЧ_ННС = ТаблицаННС.Добавить();
					ТЧ_ННС.Товар = ТЧ_ТЧ.Товар;	
					ТЧ_ННС.Продукция = ТЧ_ТЧ.Продукция;	
					ТЧ_ННС.ГруппаЛинеек = ТЧ_ТЧ.Продукция.Линейка.Родитель;
					ТЧ_ННС.Порядок = ТЧ_ТЧ.Продукция.Линейка.Родитель.Порядок;
					ТЧ_ННС.Количество =ТЧ_ТЧ.Количество;
					КонецЦикла;
				ТаблицаННС.Свернуть("Порядок,ГруппаЛинеек,Товар,Продукция","Количество");
				ТаблицаННС.Сортировать("Порядок,ГруппаЛинеек,Товар,Продукция");
				КоличествоВсего = 0;
				ОблШапка.Параметры.Контрагент = НС.Значение.Контрагент;
				ОблШапка.Параметры.ТранспортнаяКомпания = НС.Значение.КартаДоставки.ТрансКом;
				ОблШапка.Параметры.Город = НС.Значение.КартаДоставки.Город;
				ОблШапка.Параметры.Номер = НС.Значение.Номер;
				ОблШапка.Параметры.ДатаОтгрузки = Формат(НС.Значение.ДатаОтгрузки,"ДЛФ=DD")+" ("+Формат(НС.Значение.ДатаОтгрузки,"ДФ=дддд")+")";
				ОблШапка.Параметры.НомерЛинейкиУпаковки = НС.Значение.ЛинейкаУпаковки;
				СписокСчетов = Новый СписокЗначений;

					Для каждого ТЧ_ТЧ Из НС.Значение.ТабличнаяЧасть Цикл
					Выборка = СписокСчетов.НайтиПоЗначению(СокрЛП(ТЧ_ТЧ.ЗаказНаПроизводство.Номер));
						Если Выборка = Неопределено Тогда
						СписокСчетов.Добавить(СокрЛП(ТЧ_ТЧ.ЗаказНаПроизводство.Номер));		
						КонецЕсли; 
					КонецЦикла;
				ОблШапка.Параметры.НомераСчетов = СписокСчетов;
				ТабДок.Вывести(ОблШапка);
				QRCode = СокрЛП(НС.Значение.Номер)+";"+ЗначениеВСтрокуВнутр(НС.Значение);
					Для каждого ТЧ_ННС Из ТаблицаННС Цикл
					ОблТовар.Параметры.Линейка = ТЧ_ННС.ГруппаЛинеек;		
					ОблТовар.Параметры.Товар = ТЧ_ННС.Товар;
					ОблТовар.Параметры.Артикул = ТЧ_ННС.Товар.Код;
					ОблТовар.Параметры.Количество = ТЧ_ННС.Количество;
					ОблТовар.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ_ННС.Продукция.ЕдиницаИзмерения.Наименование);
					ОблТовар.Параметры.Стеллаж = "";
					ОблТовар.Параметры.Стойка = "";
					ОблТовар.Параметры.Полка = "";
					ОблТовар.Параметры.Ячейка = "";
					ЯчейкиХранения = РегистрыСведений.ЯчейкиХранения.Выбрать(Новый Структура("МПЗ",ТЧ_ННС.Продукция));
						Пока ЯчейкиХранения.Следующий() Цикл
						ОблТовар.Параметры.Стеллаж = ЯчейкиХранения.Стеллаж;
						ОблТовар.Параметры.Стойка = ЯчейкиХранения.Стойка;
						ОблТовар.Параметры.Полка = ЯчейкиХранения.Полка;
						ОблТовар.Параметры.Ячейка = ЯчейкиХранения.Ячейка;		
						КонецЦикла;		
					ТабДок.Вывести(ОблТовар);
					QRCode = QRCode+";"+ТЧ_ННС.Товар.Код+";"+ТЧ_ННС.Количество;
					КоличествоВсего = КоличествоВсего + ТЧ_ННС.Количество;
					КонецЦикла;
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRCode, 0, 500);	
					Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
					КартинкаQRКода = Новый Картинка(ДанныеQRКода);
					ОблКонец.Рисунки.QRCode.Картинка = КартинкаQRКода;
					Иначе
					Сообщить("Не удалось сформировать QR-код!");
					КонецЕсли;
				ОблКонец.Параметры.Количество = КоличествоВсего;
				ОблКонец.Параметры.Комментарий = ТЧ.Комментарий;
				ТабДок.Вывести(ОблКонец);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЦикла;
	КонецЦикла;
ТабДок.ПолеСлева =0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок); 
КонецФункции

&НаКлиенте
Процедура ПечатьННС(Команда)
ТД = ПечатьННСНаСервере();
ТД.Показать("Накладные на сборку");
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаПоЗапросуПриИзменении(Элемент)
Элементы.СписокДнейНедели.Доступность = Не ОтгрузкаПоЗапросу;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаЗНП Цикл
	ТЧ.Пометка = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаЗНП Цикл
	ТЧ.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьГотовыеКОтгрузкеНаСервере()
ТаблицаРазрешениеОтгрузки.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
	|	ЗаказНаПроизводство.ДатаРассылки КАК ДатаРассылки
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Закрыт = ЛОЖЬ
	|	И ЗаказНаПроизводство.ВидОтгрузки <> &ВидОтгрузки
	|	И ЗаказНаПроизводство.ОтгрузкаРазрешена = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство.Дата";
Запрос.УстановитьПараметр("ВидОтгрузки",Перечисления.ВидыОтгрузки.ПустаяСсылка());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Частичная Тогда	
		ТЗ = ПроверитьЧастичнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);			
			Если ТЗ.Количество() > 0 Тогда
			ТЧ = ТаблицаРазрешениеОтгрузки.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;
			ТЧ.ДатаРассылки = ВыборкаДетальныеЗаписи.ДатаРассылки;
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Полная Тогда
		Результат = ПроверитьПолнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);
 			Если Результат.Полный Тогда
			ТЧ = ТаблицаРазрешениеОтгрузки.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;
			ТЧ.ДатаРассылки = ВыборкаДетальныеЗаписи.ДатаРассылки;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьГотовыеКОтгрузке(Команда)
Состояние("Обработка...",,"Получение данных...");
ПолучитьГотовыеКОтгрузкеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьEmailСотрудника()
Возврат(ПараметрыСеанса.Пользователь.Email);
КонецФункции

&НаСервере
Функция ПолучитьEmailПолучателя(ЗНП)
Возврат(ЗНП.Автор.Email);
КонецФункции

&НаСервере
Функция РассылкаСостоялась(ЗНП)
Возврат(ЗначениеЗаполнено(ЗНП.ДатаРассылки));
КонецФункции

&НаСервере
Процедура ЗафиксироватьДатуРассылки(ЗНП)
ЗНПОбъект = ЗНП.ПолучитьОбъект();
ЗНПОбъект.ДатаРассылки = ТекущаяДата();
ЗНПОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтактноеЛицо(ЗНП)
Возврат(?(ЗначениеЗаполнено(ЗНП.КонтактноеЛицо),ЗНП.КонтактноеЛицо,"не указано"));
КонецФункции 

&НаСервере
Функция ПолучитьТелефоныКонтактногоЛица(ЗНП)
Возврат(?(ЗначениеЗаполнено(ЗНП.ТелефоныКонтактногоЛица),ЗНП.ТелефоныКонтактногоЛица,"не указано"));
КонецФункции  

&НаСервере
Функция ПолучитьEmailПолучателяИзСписка(Сотрудник)
Возврат(Сотрудник.Email);
КонецФункции

&НаКлиенте
Процедура ПочтоваяРассылкаГотовыхКОтгрузке(Команда)
	Если СписокРассылки.Количество() = 0 Тогда
	Сообщить("Список рассылки пуст!");
	Возврат;
	КонецЕсли;
Состояние("Обработка...",,"Рассылка почтовых сообщений...");
EmailСотрудника = ПолучитьEmailСотрудника();
Сообщение = Новый ИнтернетПочтовоеСообщение;
ИПП = Новый ИнтернетПочтовыйПрофиль; 
Почта = Новый ИнтернетПочта;

НастройкиПочты = ОбщийМодульВызовСервера.ПолучитьНастройкиПочты();
ИПП.АдресСервераSMTP = НастройкиПочты.АдресСервераSMTP; 
ИПП.ПортSMTP = НастройкиПочты.ПортSMTP;
ИПП.ВремяОжидания = 60; 
ИПП.Пароль = НастройкиПочты.ПарольПочтовогоСервера; 
ИПП.Пользователь = EmailСотрудника;
Сообщение.Отправитель.Адрес = EmailСотрудника;
Сообщение.Получатели.Очистить();
	Для каждого Сотрудник Из СписокРассылки Цикл	
	Сообщение.Получатели.Добавить(ПолучитьEmailПолучателяИзСписка(Сотрудник.Значение));
	КонецЦикла;
		Для каждого ТЧ Из ТаблицаРазрешениеОтгрузки Цикл
			Если Не РассылкаСостоялась(ТЧ.ЗаказНаПроизводство) Тогда
			Сообщение.Тема = "Запрещена отгрузка "+ТЧ.ЗаказНаПроизводство; 
			Текст = "Здравствуйте!";
			Текст = Текст + Символы.ПС+ "";
			Текст = Текст + Символы.ПС+ ""+ТЧ.ЗаказНаПроизводство+" готов, но отгрузка запрещена!";	
			Текст = Текст + Символы.ПС+ "";
			Текст = Текст + Символы.ПС+ "Контактное лицо: "+ПолучитьКонтактноеЛицо(ТЧ.ЗаказНаПроизводство);	
			Текст = Текст + Символы.ПС+ "";
			Текст = Текст + Символы.ПС+ "Телефон контактного лица: "+ПолучитьТелефоныКонтактногоЛица(ТЧ.ЗаказНаПроизводство);	
			Текст = Текст + Символы.ПС+ "";		
			Текст = Текст + Символы.ПС+ "С уважением, служба автоматической рассылки производственной базы!";
			Сообщение.Тексты.Очистить();
			Сообщение.Тексты.Добавить(Текст);	
			// Подключиться и отправить.  
			Почта.Подключиться(ИПП);
			Почта.Послать(Сообщение); 
			Почта.Отключиться();
			ТЧ.ДатаРассылки = ТекущаяДата();
			ЗафиксироватьДатуРассылки(ТЧ.ЗаказНаПроизводство);
			КонецЕсли;		
		КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОбработаноЛогистомНаСервере(ЗНП,ВыбДата)
ЗНПОбъект = ЗНП.ПолучитьОбъект();
ЗНПОбъект.ОбработанЛогистом = Истина;
ЗНПОбъект.ДатаОбработкиЛогистом = ВыбДата;
ЗНПОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноЛогистом(Команда)
	Если Элементы.ТаблицаЗНПТаблицаЗаказов.ТекущаяСтрока <> Неопределено Тогда
	ВыбДата = ТекущаяДата();
		Если ВвестиДату(ВыбДата,"Введите дату обработки логистом",ЧастиДаты.Дата) Тогда
		ОбработаноЛогистомНаСервере(Элементы.ТаблицаЗНПТаблицаЗаказов.ТекущиеДанные.ЗаказНаПроизводство,ВыбДата);
		Элементы.ТаблицаЗНПТаблицаЗаказов.ТекущиеДанные.ДатаОбработкиЛогистом = ВыбДата;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьБезКДНаСервере()
ТаблицаКД.Очистить();
ТаблицаКДНеГотовы.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.Закрыт = ЛОЖЬ
	|	И ЗаказНаПроизводство.ВидОтгрузки <> &ВидОтгрузки
	|	И ЗаказНаПроизводство.КартаДоставки = &КартаДоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство.Дата";
Запрос.УстановитьПараметр("ВидОтгрузки",Перечисления.ВидыОтгрузки.ПустаяСсылка());
Запрос.УстановитьПараметр("КартаДоставки",Справочники.КартыДоставки.ПустаяСсылка());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Частичная Тогда	
		ТЗ = ПроверитьЧастичнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);			
			Если ТЗ.Количество() > 0 Тогда
			ТЧ = ТаблицаКД.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;	
			Иначе
			ТЧ = ТаблицаКДНеГотовы.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;								
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.Ссылка.ВидОтгрузки = Перечисления.ВидыОтгрузки.Полная Тогда
		Результат = ПроверитьПолнуюОтгрузку(ВыборкаДетальныеЗаписи.Ссылка);
 			Если Результат.Полный Тогда
			ТЧ = ТаблицаКД.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;
			Иначе
			ТЧ = ТаблицаКДНеГотовы.Добавить();
			ТЧ.ЗаказНаПроизводство = ВыборкаДетальныеЗаписи.Ссылка;					
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
ТаблицаКД.Сортировать("ЗаказНаПроизводство");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБезКД(Команда)
ПолучитьБезКДНаСервере();
КонецПроцедуры
